add arch diagram
